<template><h1 id="ui-library-starter-2" tabindex="-1"><a class="header-anchor" href="#ui-library-starter-2" aria-hidden="true">#</a> UI Library Starter 2</h1>
<br />
<p><img src="@source/../themes.jpg" alt="Colors"></p>
<h2 id="стартовыи-пример-для-быстрого-создания-переиспользуемых-модулеи-библиотек-с-состоянием-темезациеи-локализациеи-документациеи-и-режимом-разработки-на-vue3-ts-vuex4-vuepress2-i18n" tabindex="-1"><a class="header-anchor" href="#стартовыи-пример-для-быстрого-создания-переиспользуемых-модулеи-библиотек-с-состоянием-темезациеи-локализациеи-документациеи-и-режимом-разработки-на-vue3-ts-vuex4-vuepress2-i18n" aria-hidden="true">#</a> Стартовый пример для быстрого создания переиспользуемых модулей-библиотек с состоянием, темезацией, локализацией, документацией и режимом разработки (на Vue3+TS/Vuex4/VuePress2/i18n)</h2>
<p>В отличии от более примитивной первой версии этот модуль:</p>
<p>Использует хранилище, то есть содержит состояние</p>
<p>Может запускаться в полноценном режиме разработки, как будто это собственно уже сам конечный проект</p>
<p>Поддерживает темизацию и локализацию</p>
<p>Пример модуля содержит совсем немного компонент и документация на новой версии VuePress, в отличии от первой версии, не кастомизируется под фирменный стиль который предоставляет библиотека. Так сделано не только по причине лени и экономии времени, но, прежде всего, потому что кажется излишним - то что призваны продемонстрировать примеры - этого совсем не требует.</p>
<p><a href="https://github.com/ushliypakostnik/ui-library-2-test" target="_blank" rel="noopener noreferrer">Пример использующего модуль проекта - репо:<ExternalLinkIcon/></a></p>
<p><a href="https://ui-library-2-test.vercel.app/" target="_blank" rel="noopener noreferrer">Пример использующего модуль проекта - демостенд:<ExternalLinkIcon/></a></p>
</template>
